<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
  <HEAD>
    <META name="generator" content="HTML Tidy, see www.w3.org">
    <META name="Author" content="Florian Frank">
    <META name="Keywords" content="djbdns,dynamic,dns,Perl">

    <TITLE>Dynamic DNS mit DJBDNS bei PING</TITLE>
  </HEAD>

  <BODY bgcolor="#ffffff">
    <H1>Dynamic DNS mit DJBDNS bei PING</H1>

    <P>Diese Seite beschreibt, wie man auf PINGs <A href=
    "http://cr.yp.to/djbdns.html">djbdns</A>-Nameserver einen
    DNS-Namenseintrag (A-Record) f&uuml;r eine beliebige IP-Adresse
    vornehmen kann. Der Vorteil davon ist es, da&szlig; man so
    st&auml;ndig wechselnde IPs unter immer demselben Hostnamen
    erreichen kann.</P>

    <H2>Wozu das alles?</H2>

    <P>Eigentlich ist die Namensvergabe f&uuml;r IP-Adressen die
    Aufgabe des Providers der IP-Adresse. Da aber nicht alle Provider
    die M&ouml;glichkeit einer statischen IP f&uuml;r ihre Kunden
    anbieten, bekommen die Kunden bei der Einwahl jeweils dynamisch
    eine IP zugewiesen, d. h. diese kann/wird sich von Einwahl zu
    Einwahl &auml;ndern. Manchmal wird die neue Einwahl ja auch
    erzwungen... (Wer hat da T-DSL gesagt?&nbsp;:-)</P>

    <P>Auch der Namenseintrag f&auml;r die IP des sich
    einw&auml;hlenden Hosts wird sich dabei jeweils &auml;ndern. Das
    jedoch hat ganz entscheidende Nachteile:</P>

    <OL>
      <LI>Wenn sich die IP nach der Neueinwahl ge&auml;ndert hat,
      k&ouml;nnen bestehende TCP/IP-Verbindungen nicht l&auml;nger am
      Leben gehalten werden und m&uuml;ssen neu aufgebaut werden.</LI>

      <LI>Wenn andere oder man selbst auf Dienste des sich
      einw&auml;hlenden Hosts zugreifen wollen, haben sie Probleme die
      jeweils andere IP nach der erneuten Einwahl herauszufinden.</LI>

      <LI>Sich IP-Adressen zu merken ist f&uuml;r Menschen schwer, vor
      allem wenn diese sich st&auml;ndig &auml;ndern - Sich Namen zu
      merken, ist hingegen einfacher. Das ist die Rechtfertigung
      f&uuml;r die Existenz der DNS-Hierarchie an sich.<BR>
       Das ist aber bei so sch&ouml;nen Namen wie
      "pd90031ea.dip.t-dialin.net", "pD950A531.dip.t-dialin.net" oder
      "AC88AC44.ipt.aol.com" aus den dynamischen Einwahlpools vieler
      gr&ouml;&szlig;erer Provider nicht mehr der Fall. Diese Namen
      bestehen sogar anteilig aus IP-Adressen in hexadezimaler
      Darstellung und man k&ouml;nnte sich ihre Eintragung im DNS
      eigentlich gleich sparen.</LI>
    </OL>

    <P>Gegen 1. l&auml;&szlig;t sich mit Namenseintr&auml;gen alleine
    nichts ausrichten, solange der Einwahl-Provider nicht garantiert,
    da&szlig; man seine vorherige IP wiedererh&auml;lt, wenn man z. B.
    innerhalb einer bestimmten Zeitspanne erneut einw&auml;hlt. (Bei
    PING ist das z. B. der Fall, zumal die M&ouml;glichkeit besteht,
    eine statische IP zu erhalten.)</P>

    <P>Gegen 2. und 3. ist dagegen ein (Un-)kraut gewachsen: Genau wie
    die IP-Adressen bei der Einwahl bei einem Provider dynamisch
    vergeben werden, k&ouml;nnte man auch DNS-Eintr&auml;ge f&uuml;r
    diese IPs dynamisch vergeben!</P>

    <H2>Dynamic DNS</H2>

    <P>Damit das auch wie gew&uuml;nscht, funktioniert, ist es
    notwendig, einige Optimierungen des DNS auszuhebeln, die auf den
    Vorraussetzungen beruhen, da&szlig; sich IP-Adressen nur sehr
    selten &auml;ndern und eine &Auml;nderung in einer
    &Uuml;bergangsphase langsam geschehen kann.</P>

    <P>Da DNS eine verteilte, hierarchische Datenbank ist, die nach den
    Prinzipien <I>Authority</I> und <I>Delegation</I> funktioniert,
    sollte jeder Nameserver wissen, wor&uuml;ber er mit Autorit&auml;t
    Auskunft geben kann und falls er das nicht kann, welcher Nameserver
    es sonst kann oder wei&szlig;, wer es kann usw. rekursiv. Ein
    Client eines nicht zust&auml;ndigen Nameservers wird so an den
    zust&auml;ndigen Nameserver weitergeleitet.</P>

    <P>Weil es sehr wahrscheinlich ist, da&szlig; eine Nameserver
    zeitnah die gleiche oder eine &auml;hnliche Adresse aufl&ouml;sen
    mu&szlig;, wurde dieses Verfahren bei Anwachsen der DNS-Hierarchie
    optimiert, indem jeder DNS-Eintrag mit einer Zeitmarke versehen
    wurde, wie lange er g&uuml;ltig sein soll (TTL). So ist es f&uuml;r
    einen Nameserver m&ouml;glich, Eintr&auml;ge, nach denen er gefragt
    wurde, in einem Cache abzuspeichern, so da&szlig; er bei der
    n&auml;chsten Anfrage nach demselben Eintrag gleich selbst
    antworten kann, ohne die gesamte Hierarchie erneut
    durchzugehen.</P>

    <P>Da &uuml;bliche TTL-Werte einige Tage betragen, dauert es auch
    so lange, bis &Auml;nderungen zu allen Nameservern propagiert
    werden: Erst wenn ein gecachter Eintrag abgelaufen (expired) ist,
    wird der Nameserver bei einer erneuten Anfrage wieder einen
    Nameserver mit Autorit&auml;t befragen. Das ist nat&uuml;rlich
    f&uuml;r sich st&auml;ndig &auml;ndernde IP-Adressen v&ouml;llig
    ungeeignet!</P>

    <P>Stattdessen kann man den TTL-Wert auf sehr kleine Werte oder
    Null setzen, so da&szlig; sie nicht oder nicht mehr sehr lange im
    Cache gehalten werden. Der Nachteil ist eine erh&ouml;hte Belastung
    f&uuml;r das DNS-System, das jetzt entlang eines Hierarchiepfades
    mehr Anfragen bearbeiten mu&szlig;, als wenn einige davon direkt
    aus den Nameserver Caches beantwortet werden k&ouml;nnten.</P>

    <H2>Dynamic DNS in der Subdomain dyna.ping.de</H2>

    <P>Trotz des oben geschilderten Nachteils durch weniger Cache Hits,
    habe ich ein Client-Server-System gebastelt, da&szlig; es jedem
    Mitglied erm&ouml;glicht von PING erm&ouml;glicht, dynamische
    DNS-Eintr&auml;ge unter einer Subdomain "dyna.ping.de" vorzunehmen.
    Wenn jemand (z. B. ich selbst) die Site "nixe" besitzt, kann er
    eine beliebige IP-Adresse unter "nixe.dyna.ping.de" erreichen. Die
    TTL ist im Moment fest auf eine Minute eingestellt, d. h. nach
    sp&auml;testens einer Minute sollte die neue IP f&uuml;r euren
    A-Record propagiert worden sein.</P>

    <P>Ben&ouml;tigt wird der Client <A href=
    "dyna_client.html">dyna_client</A> ein kleines Perlprogramm
    (Download: <A href="dyna_client">dyna_client</A>), die Module <A
    href=
    "http://search.cpan.org/search?dist=Digest-MD5">Digest::MD5</A> und
    <A href=
    "http://search.cpan.org/search?dist=Digest-SHA1">Digest::SHA1</A> ,
    der eigene Sitename und das PING Admin Passwort der eigenen Site.
    F&uuml;r den Namen "nixe.dyna.ping.de" und die IP-Adresse
    3.141.59.26 lautet der Aufruf so:</P>
<PRE>
$ dyna_client nixe supergeheim 3.141.59.26
</PRE>

    <P>Wenn man den Client von dem entsprechenden Host bzw. einem Host
    hinter einem maskierenden Host seines LANs aufruft, kann man auch
    "local" statt der IP angeben:</P>
<PRE>
$ dyna_client nixe supergeheim local
</PRE>

    <P>Der Server <A href="dyna_server.html">dyna_server</A>, der auf
    Port 5353 von "lilly.ping.de" lauscht, verwendet dann die
    IP-Adresse, von der die Verbindung kam, f&uuml;r den A-Record.</P>

    <P>Wenn man den A-Record wieder l&ouml;schen will, kann man
    dyna_client so aufrufen:</P>
<PRE>
$ dyna_client nixe supergeheim 0.0.0.0
</PRE>
    Unter unixoiden Betriebssystemen f&uuml;gt man am besten das
    &Auml;quivalent f&uuml;r die eigene Site von 
<PRE>
/usr/local/bin/dyna_client nixe supergeheim local
</PRE>
    in die Dateien /etc/ppp/ip-up bzw. /etc/ppp/ip-up.local ein, welche
    wegen des Passwortes am besten nur f&uuml;r root lesbar sein
    sollten. Dann wird bei jeder Neueinwahl via PPP erst einmal der
    Dynaserver kontaktiert und ihm die neue IP-Adresse des eigenen
    Hosts mitgeteilt. Das wars schon. 

    <H2>Vielleicht noch offene Fragen:</H2>

    <H3>Hilfe! Ich kann doch nicht einfach mein Passwort &uuml;ber
    feindliche Netzwerke verschicken!</H3>

    <P>Stimmt. Darum implementieren dyna_client und dyna_server ein
    Challenge Response-Protokoll, d. h. das Passwort wird nicht
    &uuml;bertragen, sondern nur durch Kryptographische Hashfunktionen
    erzeugte digitale Signaturen des Passwortes und anderer Werte:</P>
<PRE>
Server -&gt; Client: CHA=[168bit Number]
Client -&gt; Server: RES=sha1,sha1(sha1,SITE,PASS,CHA,IPAD),SITE,IPAD
Server -&gt; ACK|NAK
</PRE>

    <P>Zur Zeit werden nur MD5 (128-bit) und SHA1 (168-bit)
    unterst&uuml;tzt, Default ist die l&auml;ngere SHA1-Hashfunktion.
    Durch das Protokoll werden auch Replay-Attacken verhindert, falls
    jemand die Verbindung belauschen sollte.</P>

    <H3>Toll. L&auml;uft aber wahrscheinlich nicht unter
    M$-Betriebssystemen.</H3>

    <P>Jein. Obwohl ich nat&uuml;rlich unter Linux entwickelt habe,
    lief der Client ohne weitere Anpassungen z. B. unter Windows. Wenn
    man sich Active Perl von www.activestate.com herunterl&auml;dt und
    den <A href=
    "http://www.activestate.com/Products/ActivePerl/index.html">Anweisungen</A>
    dort folgt und es installiert, kann man mit perl im Pfad jeweils
    "perl dyna_client ..." aufrufen. Die Digest-Module mu&szlig; man
    sich nicht selbst herunterladen, sie sind in dem Paket von Active
    State schon enthalten.</P>

    <P>Ich bin leider ignorant, wie man unter Windows, automatisch ein
    bestimmtes Programm nach der PPP-Einwahl startet. Falls jemand dazu
    etwas wei&szlig; und es hier stehen soll, soll er bitte ein kurze
    Mail an <A href="mailto:flori@ping.de">mich</A> schreiben. Alles
    andere verh&auml;lt sich genauso, wie oben erkl&auml;rt.</P>

    <H2>Downloads</H2>

    <UL>
      <LI>
        Hier die Dynadns-Sourcen zum Downloaden und Anschauen in bunt
        (HTML). 

        <UL>
          <LI>dyna_client als <A name="client" href="http://www.ping.de/~flori/programs/perl/dynadns/dyna_client">Perl
          Source</A> bzw. <A href="http://www.ping.de/~flori/programs/perl/dynadns/dyna_client.html">HTML</A> und</LI>

          <LI>dyna_server als <A name="server" href="http://www.ping.de/~flori/programs/perl/dynadns/dyna_server">Perl
          Source</A> bzw. <A href="http://www.ping.de/~flori/programs/perl/dynadns/dyna_server.html">HTML</A>.</LI>
        </UL>
        <BR>
      </LI>

      <LI>
        Die Digest-Module: 

        <UL>
          <LI><A href=
          "http://search.cpan.org/search?dist=Digest-MD5">Digest::MD5</A>
          und</LI>

          <LI><A href=
          "http://search.cpan.org/search?dist=Digest-SHA1">Digest::SHA1</A>.</LI>
        </UL>
        <BR>
      </LI>

      <LI>Die Perl Distribution von Active State: <A href=
      "http://www.activestate.com/Products/ActivePerl/index.html">Active
      Perl</A>.</LI>
    </UL>
    <HR>

    <TABLE width="100%">
      <TR>
        <TD align="RIGHT"><B>(c) Florian Frank <A href=
        "mailto:flori@ping.de">&lt;flori@ping.de&gt;</A></B> </TD>
      </TR>
    </TABLE>
  </BODY>
</HTML>

